tutorials/elbow/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
918
(
(1 1.93763e-08 0)
(-5.16564e-08 -5.16566e-08 0)
(5.9232e-08 0.997406 0)
(1 5.42785e-08 0)
(2.13195e-06 0.975324 8.06182e-17)
(-1.93971e-08 1.93962e-08 -1.51792e-24)
(0.681585 1.12943 1.81694e-24)
(0.661271 0.371919 5.69892e-19)
...
)
;

boundaryField
{
    wall-4
    {
        type            noSlip;
    }
    velocity-inlet-5
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    velocity-inlet-6
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    pressure-outlet-7
    {
        type            zeroGradient;
    }
    wall-8
    {
        type            noSlip;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
