tutorials/elbow/0/Ulift1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
918
(
(1.77939e-10 -1.77939e-10 0)
(-3.50597e-06 1 0)
(3.41001e-08 0.249334 0)
(1.50302e-08 1.50302e-08 0)
(5.03559e-07 0.243858 2.01568e-17)
(-4.55367e-05 1 -3.60146e-17)
(0.131584 0.218044 -1.42618e-25)
(-0.0758168 -0.0426416 -6.53398e-20)
...
)
;

boundaryField
{
    wall-4
    {
        type            noSlip;
    }
    velocity-inlet-5
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    velocity-inlet-6
    {
        type            fixedValue;
        value           uniform (0 1 0);
    }
    pressure-outlet-7
    {
        type            zeroGradient;
    }
    wall-8
    {
        type            noSlip;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
