tutorials/elbow/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      Gauss limitedLinearV 1;

div((interpolate(U)&S),U) Gauss limitedLinearV 1;
div((interpolate(U)&S),Usup) Gauss limitedLinearV 1;
div((interpolate(U)&S),Ulift0) Gauss limitedLinearV 1;
div((interpolate(Usup)&S),U) Gauss limitedLinearV 1;
div((interpolate(Usup)&S),Usup) Gauss limitedLinearV 1;
div((interpolate(Usup)&S),Ulift0) Gauss limitedLinearV 1;
div((interpolate(Ulift0)&S),U) Gauss limitedLinearV 1;
div((interpolate(Ulift0)&S),Usup) Gauss limitedLinearV 1;
div((interpolate(Ulift0)&S),Ulift0) Gauss limitedLinearV 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


fluxRequired
{
    default         no;
    p;
    Phi;
}


// ************************************************************************* //
